<?php
class App_View_Helper_Tr extends Zend_View_Helper_Abstract
{
    public function tr($text)
    {
        $text = strval($text);
        $iso = array(
           "Є" => "YE", "І" => "I", "Ѓ" => "G"," і" => "i", "№" => "#", "є" => "ye", "ѓ" => "g",
           "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D",
           "Е" => "E", "Ё" => "YO", "Ж" => "ZH",
           "З" => "Z", "И" => "I", "Й" => "J", "К" => "K", "Л" => "L",
           "М" => "M", "Н" => "N", "О" => "O", "П" => "P", "Р" => "R",
           "С" => "S", "Т" => "T", "У" => "U", "Ф" => "F", "Х" => "X",
           "Ц" => "C", "Ч" => "CH", "Ш" => "SH", "Щ" => "SHH", "Ъ" => "",
           "Ы" => "Y", "Ь" => "", "Э" => "E", "Ю" => "YU", "Я" => "YA",
           "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d",
           "е" => "e", "ё" => "yo", "ж" => "zh",
           "з" => "z", "и" => "i", "й" => "j", "к" => "k", "л" => "l",
           "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
           "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "x",
           "ц" => "c", "ч" => "ch", "ш" => "sh", "щ" => "shh", "ъ" => "",
           "ы" => "y", "ь" => "", "э" => "e", "ю" => "yu", "я" => "ya",
           " " => "-",
           "1" => "1", "2" => "2", "3" => "3", "4" => "4", "5" => "5", "6" => "6", "7" => "7", "8" => "8", "9" => "9", "0" => "0"
           /*"«" => "", "»" => "", "—" => "-", "&" => "", "'" => "", '"' => "", "?" => "", "!" => ""*/
          );

        $lat = strtr($text, $iso);
        $len = strlen($lat);

        $result = '';
        for ($i=0; $i<$len; $i++)
        {
            $ord = ord($lat[$i]);
            if (($ord>96 && $ord<123) || ($ord>64 && $ord<91) || $ord==45 || ($ord>47 && $ord<58))
            {
                $result .= $lat[$i];
            }
        }

        return $result;
    }
}
